Этот софт нужен для поиска разницы(Спрэда) в цене между токенами на Криптобиржах(Binance, Bybit, Huobi).
В 9 строке файла измените искомую разницу в процентах для отслеживания интересующих вас событий .
На счет актуальности не уверен , в январе получалось находить разницу в 1-2 процента .
Если это читает человек решивший заработать на этом денег , рекомендую добавить в него новые криптобиржи ,
на которых еще нет кучи высокочастотных ботов которые моментольно съедают весь спрэд.

Устрановка : 
    версии библиотек в requiremets.txt 
    версия питона 3.8.3 